export const GAME_MODES = [
  { id: 'human', name: 'Человечный', cost: 3 },
  { id: 'true', name: 'Трушный', cost: 2 },
  { id: 'light', name: 'Лайтовый', cost: 1 },
] as const;

export const DIFFICULTIES = [
  { id: 'dummy', name: 'Для чайников' },
  { id: 'people', name: 'Для людей' },
  { id: 'genius', name: 'Для гениев' },
  { id: 'god', name: 'Для богов' },
] as const;

export const TEMPLATE_TOPICS = [
  "История России", "Мировая литература", "География", "Кинематограф", "Музыка 90-х",
  "Наука и технологии", "Спорт", "Животный мир", "Искусство", "Космос",
  "Видеоигры", "Кулинария", "Автомобили", "Мода", "Языки мира",
  "Мифология", "Архитектура", "Психология", "Экономика", "Политика",
  "Советские мультфильмы", "Голливуд", "Рок-музыка", "Классическая музыка", "Футбол",
  "Теннис", "Баскетбол", "Олимпийские игры", "Великие открытия", "Медицина",
  "Программирование", "Математика", "Физика", "Химия", "Биология",
  "Астрономия", "Философия", "Религия", "Комиксы", "Аниме",
  "Сериалы", "Театр", "Танцы", "Фотография", "Дизайн",
  "Маркетинг", "Бизнес", "Криптовалюты", "Экология", "Путешествия"
];

export const LOGO_URL = "https://i.ibb.co/Fcp02H0/61755067-2e42-4ae2-97de-7da4228654ef.png";
